---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextNoteType
source: html/27bdf444-3929-7def-2643-d453f6ce7a97.htm
---
# TextNoteType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.